## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # zentral_munki_script_check.mcs-systemsettings-system_settings_screensaver_timeout_enforce will be updated in-place
  ~ resource "zentral_munki_script_check" "mcs-systemsettings-system_settings_screensaver_timeout_enforce" {
      ~ description      = <<-EOT
          - The screen saver timeout _MUST_ be set to 1234 seconds or a shorter length of time.
          + The screen saver timeout _MUST_ be set to 1200 seconds or a shorter length of time.
            
          - This rule ensures that a full session lock is triggered within no more than 1234 seconds of inactivity.
          + This rule ensures that a full session lock is triggered within no more than 1200 seconds of inactivity.
        EOT
      ~ excluded_tag_ids = [] -> (known after apply)
        id               = 58
        name             = "[mSCP] - System Settings - Enforce Screen Saver Timeout"
      ~ source           = <<-EOT
            /usr/bin/osascript -l JavaScript << EOS
            function run() {
              let timeout = ObjC.unwrap($.NSUserDefaults.alloc.initWithSuiteName('com.apple.screensaver')\
            .objectForKey('idleTime'))
          -   if ( timeout <= 1234 ) {
          +   if ( timeout <= 1200 ) {
                return("true")
              } else {
                return("false")
              }
            }
            EOS
        EOT
      ~ tag_ids          = [] -> (known after apply)
      ~ version          = 1 -> (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```
</details>